# set arguments for all "brew install --cask" commands
cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Basic
brew "git"
brew "wget"
brew "tree"

# Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Node shit
brew "node"
brew "npm"
brew "nvm"
brew "yarn"

# Urils
brew "task"
brew "cmatrix"

# CLI tools
brew "tmux"
brew "fzf"
brew "neovim"
brew "htop"
brew "btop"
brew "lazydocker"
brew "lazygit"
brew "k9s"
brew "kubeseal"
brew "rabbitmq"

# python
brew "pipx"
brew "python@3.12"
brew "python@3.11"
brew "python@3.10"

# other
brew "postgresql@14"
cask "google-cloud-sdk"


# C/C++
brew "gcc"
brew "cmake"
# brew "catch2"
# brew "clang-format"
# brew "log4cxx"
# brew "spdlog"

# GUI apps
cask "raycast"
cask "google-drive"
cask "telegram"
cask "docker"
